base = {" Место:1"
        " Билет: №132411" 
        " Маршрут: Москва -> Питер"
        " Пассажир: Иванов И.И" 
        " Паспорт: 888 010101"}

base.update({"Место:2"
        " Билет: №1324113" 
        " Маршрут: Москва -> Воронеж"
        " Пассажир: Иванов И.И" 
        " Паспорт: 5777 010101"})
base.update({"Место:3"
        " Билет: №132412" 
        " Маршрут: Москва -> Новосибирск"
        " Пассажир: Иванов И.И" 
        " Паспорт: 2121 010101"})
base.update({"Место:4"
        " Билет: №132414" 
        " Маршрут: Москва -> Барнаул"
        " Пассажир: Иванов И.И" 
        " Паспорт: 4141 010101"})
base.update({"Место:5"
        " Билет: №13241211" 
        " Маршрут: Москва -> Крым"
        " Пассажир: Иванов И.И" 
        " Паспорт: 5151 010101"})
base.update({"Место:6"
        " Билет: №132412" 
        " Маршрут: Москва -> Новосибирск"
        " Пассажир: Иванов И.И" 
        " Паспорт: 5111 010141"})

for dictionary in base:
    print(dictionary)

def create_ticket():
    ticket = {}
    ticket["маршурт билет"] = input("Введите маршрут: ")
    ticket["ФИО_пользователя"] = input("Введите фамилию и инициалы: ")
    ticket["данные паспорта"] = input("введите данные паспорта: ")
    return ticket



    

